[
    {
        "id": "sevenArmedStarfish",
        "type": "Invertebrate",
        "name": "Seven-Armed Starfish",
        "scientificName": "Luidia ciliaris",
        "description": [
            "L. ciliaris is an orangeish-brown colour and has seven long arms radiating from a small disk. It is a large but fragile sea star, growing to 40 cm across, and easily losing its arms (which afterwards regenerate).",
            "L. ciliaris occurs on the seabed in the eastern Atlantic Ocean from Norway and the Faroe Islands southwards to Cape Verde and the Azores and in the Mediterranean Sea. It is found in the neritic zone at depths down to 400 m, mainly on soft sediments into which it sometimes burrows, but sometimes on rock.",
            "L. ciliaris is a predator and scavenger and feeds predominantly on other echinoderms. A study in the Irish Sea found that the brittle stars and the sea urchin formed the chief items of prey."
        ],
        "likeCounter": 0,
        "dangerLevel": 0,
        "imageURL": "http://127.0.0.1:5500/img/invertebratePage/sevenArmedStarfish.jpg"
    },
    {
        "id": "blueAngel",
        "type": "Invertebrate",
        "name": "Blue Angel",
        "scientificName": "Glaucus atlanticus",
        "description": [
            "Glaucus atlanticus is a species of small, blue sea slug, a pelagic aeolid nudibranch, a shell-less gastropod mollusk in the family Glaucidae.",
            "At maturity Glaucus atlanticus can be up to 3 centimetres in length, though larger specimens have been found. It can live up to a year under the right conditions. It is silvery grey on its dorsal side and dark and pale blue ventrally. It has dark blue stripes on its head. It has a flat, tapering body and six appendages that branch out into rayed, finger-like cerata.",
            "G. atlanticus preys on other larger pelagic organisms. The sea slugs can move toward prey or mates by using their cerata to make slow swimming movements. They are known to prey on the dangerously venomous Portuguese man o' war, the blue button, and the violet snail. Occasionally, individuals attack and eat other individuals in captivity."
        ],
        "likeCounter": 1,
        "dangerLevel": 0,
        "imageURL": "http://127.0.0.1:5500/img/invertebratePage/blueAngel.jpg"
    },
    {
        "id": "giantClam",
        "type": "Invertebrate",
        "name": "Giant Clam",
        "scientificName": "Tridacna gigas",
        "description": [
            "Tridacna gigas is one of the most endangered clam species. The giant  clam lives in flat coral sand or broken coral and can be found at depths of as much as 20 m. Its range covers the Indo-Pacific, but populations are diminishing quickly, and the giant clam has become extinct in many areas where it was once common.",
            "Algae provide giant clams with a supplementary source of nutrition. These plants consist of unicellular algae, whose metabolic products add to the clam's filter food. As a result, they are able to grow as  large as one meter in length even in nutrient-poor coral-reef waters.",
            "Tridacna gigas reproduce sexually and are hermaphrodites. Self-fertilization is not possible, but this characteristic does allow them to reproduce with any other member of the species."
        ],
        "likeCounter": 2,
        "dangerLevel": 0,
        "imageURL": "http://127.0.0.1:5500/img/invertebratePage/giantClam.jpg"
    },
    {
        "id": "blueRingedOctopus",
        "type": "Invertebrate",
        "name": "Blue-ringed Octopus",
        "scientificName": "Hapalochlaena",
        "description": [
            " Blue-ringed octopuses, comprising the genus Hapalochlaena, are four highly venomous species of octopus that are found in tide pools and coral reefs in the Pacific and Indian oceans, from Japan to Australia. The species tend to have a lifespan of approximately two years.",
            "They are recognized as one of the world's most venomous marine animals. Despite their small size (12 to 20 cm) and relatively docile nature, they carry enough venom to kill 26 adult humans. Their bites are tiny and often painless, with many victims not realizing they have been envenomated until respiratory depression and paralysis begins.",
            "The venom can result in nausea, respiratory arrest, heart failure, severe and sometimes total paralysis, blindness, and can lead to death within minutes if not treated."
        ],
        "likeCounter": 3,
        "dangerLevel": 4.5,
        "imageURL": "http://127.0.0.1:5500/img/invertebratePage/blueRingedOctopus.jpg"
    },
    {
        "id": "seaWasp",
        "type": "Invertebrate",
        "name": "Sea Wasp",
        "scientificName": "Chironex fleckeri",
        "description": [
            "Chironex fleckeri is a species of extremely venomous box jellyfish found in coastal waters from northern Australia and New Guinea to Malaysia, the Philippines and Vietnam. It has been described as \"the most lethal jellyfish in the world\".",
            "Notorious for its sting, C. fleckeri has tentacles up to 3 m long covered with millions of cnidocytes which, on contact, release microscopic darts delivering an extremely powerful venom. Being stung commonly results in excruciating pain, and if the sting area is significant, an untreated victim may die in two to five minutes. The amount of venom in one animal is said to be enough to kill 60 adult humans.",
            "In Australia, C. fleckeri has caused at least 64 deaths since the first report in 1883, but most encounters appear to result only in mild envenomation. When people do die, it is usually caused by a cardiac arrest occurring within minutes of the sting."
        ],
        "likeCounter": 4,
        "dangerLevel": 4.5,
        "imageURL": "http://127.0.0.1:5500/img/invertebratePage/seaWasp.jpg"
    },
    {
        "id": "gooseBarnacle",
        "type": "Crustacean",
        "name": "Goose Barnacle",
        "scientificName": "Pollicipes pollicipes",
        "description": [
            "Goose barnacles, also called stalked barnacles or gooseneck barnacles, are filter-feeding crustaceans that live attached to hard surfaces of rocks and flotsam in the ocean intertidal zone. Unlike most other types of barnacles, intertidal goose barnacles depend on water motion rather than the movement of their cirri for feeding, and are therefore found only on exposed or moderately exposed coasts.",
            "In Portugal and Spain, the species is a widely consumed and expensive delicacy known as percebes. Percebes are harvested commercially in the Iberian northern coast, mainly in Galicia and Asturias.",
            "In the days before it was realised that birds migrate, it was thought that barnacle geese developed from this crustacean through spontaneous generation, since they were never seen to nest in temperate Europe."
        ],
        "likeCounter": 0,
        "dangerLevel": 0,
        "imageURL": "http://127.0.0.1:5500/img/crustaceanPage/gooseBarnacle.jpg"
    },
    {
        "id": "hermitCrab",
        "type": "Crustacean",
        "name": "Hermit Crab",
        "scientificName": "Clibanarius erythropus",
        "description": [
            "Clibanarius erythropus is a species of hermit crab that lives in rockpools and sublittoral waters. It is found in the Mediterranean Sea, Black Sea and eastern Atlantic Ocean from the Azores to Brittany, the Channel Islands and as far north as the south Cornwall coast. Individuals may grow up to a carapace length of 15 millimetres.",
            "Like other hermit crabs, C. erythropus feeds on organic debris, decayed and fresh macro-algae, small invertebrates, and macroscopic pieces of animal tissues.",
            "The strong association between hermit crabs and their shelters has significantly influenced their biology. This protective mobility contributes to the diversity and multitude of crustaceans found in almost all marine environments. It has been shown that C. erythropus individuals select substrates where they can cover large distances, and that globose shells allow them greater mobility than elongate ones."
        ],
        "likeCounter": 0,
        "dangerLevel": 0,
        "imageURL": "http://127.0.0.1:5500/img/crustaceanPage/hermitCrab.jpg"
    },
    {
        "id": "redKingCrab",
        "type": "Crustacean",
        "name": "Red King Crab",
        "scientificName": "Paralithodes camtschaticus",
        "description": [
            "The red king crab, also called Kamchatka crab or Alaskan king crab, is a species of king crab native to the far northern Pacific Ocean, including the Bering Sea and Gulf of Alaska, but also introduced to the Barents Sea.",
            "The red king crab is the largest species of king crab. Red king crabs can reach a carapace width up to 28 cm, a leg span of 1.8 m, and a weight of 12.7 kg. It was named after the color it turns when it is cooked rather than the color of a living animal, which tends to be more burgundy.",
            "It is the most coveted of the commercially sold king crab species, and it is the most expensive per unit weight. It is most commonly caught in the Bering Sea and Norton Sound, Alaska, and is particularly difficult to catch, but is nonetheless one of the most preferred crabs for consumption."
        ],
        "likeCounter": 0,
        "dangerLevel": 1,
        "imageURL": "http://127.0.0.1:5500/img/crustaceanPage/redKingCrab.jpg"
    },
    {
        "id": "mantisShrimp",
        "type": "Crustacean",
        "name": "Mantis Shrimp",
        "scientificName": "Odontodactylus scyllarus",
        "description": [
            "Mantis shrimps, are carnivorous marine crustaceans of the order Stomatopoda. Mantis shrimps typically grow to around 10 cm in length, while a few can reach up to 38 cm.",
            "They're now sometimes referred to as \"thumb splitters\" because of the animal's ability to inflict painful wounds if handled incautiously. Mantis shrimp are commonly separated into two distinct groups determined by the type of claws they possess - Smashers and Spearers. Both types strike by rapidly unfolding and swinging their raptorial claws at the prey with an acceleration of 102,000 m/s2 and speeds of 23 m/s from a standing start, and can inflict serious damage on victims significantly greater in size than themselves.",
            "Smashers use this ability to attack snails, crabs, molluscs, and rock oysters. Spearers, however, prefer the meat of softer animals, such as fish, which their barbed claws can more easily slice and snag."
        ],
        "likeCounter": 0,
        "dangerLevel": 2.5,
        "imageURL": "http://127.0.0.1:5500/img/crustaceanPage/mantisShrimp.jpg"
    },
    {
        "id": "japaneseSpiderCrab",
        "type": "Crustacean",
        "name": "Japanese Spider Crab",
        "scientificName": "Macrocheira kaempferi",
        "description": [
            "The Japanese spider crab (Macrocheira kaempferi) is a species of marine crab that lives in the waters around Japan. It has the greatest leg span of any arthropod, reaching up to 3.7 metres from claw to claw. The body may grow to a size of 40 cm in carapace width and the whole crab can weigh up to 19 kilograms.",
            "The Japanese spider crab is known to the Japanese for the serious injuries it can cause with its strong claws. It is occasionally collected for food, and even considered a delicacy in many parts of Japan and other areas in the region.",
            "Female crabs carry the fertilized eggs attached to their abdominal appendages until they hatch into tiny planktonic larvae. They can lay up to 1.5 million eggs per season, and these eggs will hatch in 10 days on average. Once hatched, these larvae undergo four stages of development before they mature into adulthood."
        ],
        "likeCounter": 0,
        "dangerLevel": 3,
        "imageURL": "http://127.0.0.1:5500/img/crustaceanPage/japaneseSpiderCrab.jpg"
    },

    {
        "id": "",
        "type": "[placeholder]",
        "name": "",
        "scientificName": "",
        "description": ["", "", ""],
        "likeCounter": 0,
        "dangerLevel": 0,
        "imageURL": ""
    }
]
